balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F67K22.PIC
        <edc:MuxedSFRDef edc:nzwidth="8">
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2ADD" edc:nzwidth="0x8" edc:por="00000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="SSP2ADD" edc:desc="" edc:mask="0xff" edc:name="SSP2ADD" edc:nzwidth="0x8"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2MSK" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP2MSK" edc:nzwidth="8" edc:por="11111111">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="MSK0" edc:desc="" edc:mask="0x1" edc:name="MSK0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK1" edc:desc="" edc:mask="0x1" edc:name="MSK1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK2" edc:desc="" edc:mask="0x1" edc:name="MSK2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK3" edc:desc="" edc:mask="0x1" edc:name="MSK3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK4" edc:desc="" edc:mask="0x1" edc:name="MSK4" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK5" edc:desc="" edc:mask="0x1" edc:name="MSK5" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK6" edc:desc="" edc:mask="0x1" edc:name="MSK6" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="MSK7" edc:desc="" edc:mask="0x1" edc:name="MSK7" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP2BUF" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSP2BUF" edc:desc="" edc:mask="0xff" edc:name="SSP2BUF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="T4CON" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PR4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP7CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="CCP7CON" edc:nzwidth="8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP7M" edc:desc="" edc:mask="0xf" edc:name="CCP7M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC7B" edc:desc="" edc:mask="0x3" edc:name="DC7B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP7M0" edc:desc="" edc:mask="0x1" edc:name="CCP7M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7M1" edc:desc="" edc:mask="0x1" edc:name="CCP7M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7M2" edc:desc="" edc:mask="0x1" edc:name="CCP7M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7M3" edc:desc="" edc:mask="0x1" edc:name="CCP7M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC7B0" edc:desc="" edc:mask="0x1" edc:name="DC7B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC7B1" edc:desc="" edc:mask="0x1" edc:name="DC7B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP7Y" edc:desc="" edc:mask="0x1" edc:name="CCP7Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7X" edc:desc="" edc:mask="0x1" edc:name="CCP7X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR7" edc:desc="" edc:name="CCPR7" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR7L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR7L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR7L" edc:desc="" edc:mask="0xff" edc:name="CCPR7L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR7H" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR7H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR7H" edc:desc="" edc:mask="0xff" edc:name="CCPR7H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP6CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="CCP6CON" edc:nzwidth="0x8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP6M" edc:desc="" edc:mask="0xf" edc:name="CCP6M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC6B" edc:desc="" edc:mask="0x3" edc:name="DC6B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP6M0" edc:desc="" edc:mask="0x1" edc:name="CCP6M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6M1" edc:desc="" edc:mask="0x1" edc:name="CCP6M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6M2" edc:desc="" edc:mask="0x1" edc:name="CCP6M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6M3" edc:desc="" edc:mask="0x1" edc:name="CCP6M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC6B0" edc:desc="" edc:mask="0x1" edc:name="DC6B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC6B1" edc:desc="" edc:mask="0x1" edc:name="DC6B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP6Y" edc:desc="" edc:mask="0x1" edc:name="CCP6Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6X" edc:desc="" edc:mask="0x1" edc:name="CCP6X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR6" edc:desc="" edc:name="CCPR6" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR6L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR6L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR6L" edc:desc="" edc:mask="0xff" edc:name="CCPR6L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR6H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR6H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR6H" edc:desc="" edc:mask="0xff" edc:name="CCPR6H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP5CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="CCP5CON" edc:nzwidth="0x8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP5M" edc:desc="" edc:mask="0xf" edc:name="CCP5M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC5B" edc:desc="" edc:mask="0x3" edc:name="DC5B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP5M0" edc:desc="" edc:mask="0x1" edc:name="CCP5M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5M1" edc:desc="" edc:mask="0x1" edc:name="CCP5M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5M2" edc:desc="" edc:mask="0x1" edc:name="CCP5M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5M3" edc:desc="" edc:mask="0x1" edc:name="CCP5M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC5B0" edc:desc="" edc:mask="0x1" edc:name="DC5B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC5B1" edc:desc="" edc:mask="0x1" edc:name="DC5B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP5Y" edc:desc="" edc:mask="0x1" edc:name="CCP5Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5X" edc:desc="" edc:mask="0x1" edc:name="CCP5X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR5" edc:desc="" edc:name="CCPR5" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR5L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR5L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR5L" edc:desc="" edc:mask="0xff" edc:name="CCPR5L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR5H" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR5H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR5H" edc:desc="" edc:mask="0xff" edc:name="CCPR5H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
