balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F67K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR12_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR12_Prescale" edc:nmmrid="48" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0xfa6" edc:endaddr="0xfc2" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="gpre"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--  Pin 1  -->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="WR"/>
      <edc:VirtualPin edc:name="P2C"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 2  -->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="RD"/>
      <edc:VirtualPin edc:name="P2D"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 3  -->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="ECCP3"/>
      <edc:VirtualPin edc:name="P3A"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 4  -->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="TX2"/>
      <edc:VirtualPin edc:name="CK2"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="C3OUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 5  -->
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="RX2"/>
      <edc:VirtualPin edc:name="DT2"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="C3INA"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 6  -->
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="CCP4"/>
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="P3D"/>
      <edc:VirtualPin edc:name="C3INB"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 7  -->
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="RG5"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 8  -->
      <edc:VirtualPin edc:name="RG4"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="T7CKI"/>
      <edc:VirtualPin edc:name="T5G"/>
      <edc:VirtualPin edc:name="CCP5"/>
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="P1D"/>
      <edc:VirtualPin edc:name="C3INC"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 9  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 10  -->
      <edc:VirtualPin edc:name="VDDCORE"/>
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 11  -->
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="SS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 12  -->
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="C1INA"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 13  -->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="C1INB"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 14  -->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="C2INA"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 15  -->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="CTMUI"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 16  -->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C1OUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 17  -->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="CTDIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 18  -->
      <edc:VirtualPin edc:name="ENVREG"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 19  -->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 20  -->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 21  -->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 22  -->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 23  -->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 24  -->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="ULPWU"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 25  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 26  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 27  -->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="T3G"/>
      <edc:VirtualPin edc:name="HLVDIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 28  -->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 29  -->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="ECCP2"/>
      <edc:VirtualPin edc:name="P2A"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 30  -->
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="SCLKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 31  -->
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="TX1"/>
      <edc:VirtualPin edc:name="CK1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 32  -->
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="RX1"/>
      <edc:VirtualPin edc:name="DT1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 33  -->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="ECCP1"/>
      <edc:VirtualPin edc:name="P1A"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 34  -->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="SCL1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 35  -->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="SDA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 36  -->
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="SDO1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 37  -->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="KBI3"/>
      <edc:VirtualPin edc:name="PGD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 38  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 39  -->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 40  -->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 41  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 42  -->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="KBI2"/>
      <edc:VirtualPin edc:name="PGC"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 43  -->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="KBI1"/>
      <edc:VirtualPin edc:name="T3CKI"/>
      <edc:VirtualPin edc:name="T1G"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 44  -->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="KBI0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 45  -->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="ECCP2"/>
      <edc:VirtualPin edc:name="PA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 46  -->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="CTED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 47  -->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="INT1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 48  -->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="FLT0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 49  -->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="PSP7"/>
      <edc:VirtualPin edc:name="SS2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 50  -->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="PSP6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 51  -->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="PSP5"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 52  -->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="PSP4"/>
      <edc:VirtualPin edc:name="SDO2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 53  -->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PSP3"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 54  -->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PSP2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 55  -->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="PSP1"/>
      <edc:VirtualPin edc:name="T5CKI"/>
      <edc:VirtualPin edc:name="T7G"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 56  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 57  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 58  -->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="PSP0"/>
      <edc:VirtualPin edc:name="CTPLS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 59  -->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="ECCP2"/>
      <edc:VirtualPin edc:name="P2A"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 60  -->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="P1B"/>
      <edc:VirtualPin edc:name="CCP6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 61  -->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="P1C"/>
      <edc:VirtualPin edc:name="CCP7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 62  -->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="P3B"/>
      <edc:VirtualPin edc:name="CCP8"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 63  -->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="P3C"/>
      <edc:VirtualPin edc:name="CCP9"/>
      <edc:VirtualPin edc:name="REF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 64  -->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="CS"/>
      <edc:VirtualPin edc:name="P2B"/>
      <edc:VirtualPin edc:name="CCP10"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>